#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
google_pubsub_topic.e_stat_importer: Refreshing state... [id=projects/ml-project-210100/topics/e-stat-importer]
google_pubsub_subscription.e_stat_importer: Refreshing state... [id=projects/ml-project-210100/subscriptions/e-stat-importer]
google_pubsub_topic.e_stat_importer_dl: Refreshing state... [id=projects/ml-project-210100/topics/e-stat-importer-dl]
module.runner["e-stat-importer"].google_cloud_run_service.main: Refreshing state... [id=locations/asia-northeast1/namespaces/ml-project-210100/services/e-stat-importer]
google_pubsub_subscription.e_stat_importer_dl: Refreshing state... [id=projects/ml-project-210100/subscriptions/e-stat-importer-dl]
google_pubsub_topic.jasso_gakuseiseikatsu_stats_importer: Refreshing state... [id=projects/ml-project-210100/topics/jasso-gakuseiseikatsu-stats-importer]
google_data_catalog_entry_group.social_data: Refreshing state... [id=projects/ml-project-210100/locations/asia-northeast1/entryGroups/social_data]
google_data_catalog_tag_template.data_ingestion: Refreshing state... [id=projects/ml-project-210100/locations/asia-northeast1/tagTemplates/data_ingestion]
module.runner["jasso-gakuseiseikatsu-stats-importer"].google_cloud_run_service.main: Refreshing state... [id=locations/asia-northeast1/namespaces/ml-project-210100/services/jasso-gakuseiseikatsu-stats-importer]
google_bigquery_dataset.social_dataset: Refreshing state... [id=projects/ml-project-210100/datasets/social_dataset]
google_service_account.pubsub_social_dashboard: Refreshing state... [id=projects/ml-project-210100/serviceAccounts/pubsub-social-dashboard@ml-project-210100.iam.gserviceaccount.com]
google_pubsub_topic.jasso_gakuseiseikatsu_stats_importer_dl: Refreshing state... [id=projects/ml-project-210100/topics/jasso-gakuseiseikatsu-stats-importer-dl]
google_pubsub_topic_iam_policy.jasso_gakuseiseikatsu_stats_importer: Refreshing state... [id=projects/ml-project-210100/topics/jasso-gakuseiseikatsu-stats-importer-dl]
google_pubsub_subscription.jasso_gakuseiseikatsu_stats_importer_dl: Refreshing state... [id=projects/ml-project-210100/subscriptions/jasso-gakuseiseikatsu-stats-importer-dl]
google_pubsub_subscription.jasso_gakuseiseikatsu_stats_importer: Refreshing state... [id=projects/ml-project-210100/subscriptions/jasso-gakuseiseikatsu-stats-importer]
google_pubsub_subscription_iam_policy.jasso_gakuseiseikatsu_stats_importer: Refreshing state... [id=projects/ml-project-210100/subscriptions/jasso-gakuseiseikatsu-stats-importer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_pubsub_subscription.e_stat_importer will be destroyed
  - resource "google_pubsub_subscription" "e_stat_importer" {
      - ack_deadline_seconds       = 10 -> null
      - enable_message_ordering    = false -> null
      - id                         = "projects/ml-project-210100/subscriptions/e-stat-importer" -> null
      - message_retention_duration = "604800s" -> null
      - name                       = "e-stat-importer" -> null
      - path                       = "projects//subscriptions/e-stat-importer" -> null
      - project                    = "ml-project-210100" -> null
      - retain_acked_messages      = false -> null
      - topic                      = "projects/ml-project-210100/topics/e-stat-importer" -> null

      - dead_letter_policy {
          - dead_letter_topic     = "projects/ml-project-210100/topics/e-stat-importer-dl" -> null
          - max_delivery_attempts = 5 -> null
        }

      - expiration_policy {
          - ttl = "2678400s" -> null
        }

      - push_config {
          - push_endpoint = "https://e-stat-importer-ekpjqszuwq-an.a.run.app" -> null

          - oidc_token {
              - service_account_email = "pubsub-social-dashboard@ml-project-210100.iam.gserviceaccount.com" -> null
            }
        }

      - retry_policy {
          - maximum_backoff = "600s" -> null
          - minimum_backoff = "10s" -> null
        }

      - timeouts {}
    }

  # google_pubsub_subscription.e_stat_importer_dl will be destroyed
  - resource "google_pubsub_subscription" "e_stat_importer_dl" {
      - ack_deadline_seconds       = 10 -> null
      - enable_message_ordering    = false -> null
      - id                         = "projects/ml-project-210100/subscriptions/e-stat-importer-dl" -> null
      - message_retention_duration = "604800s" -> null
      - name                       = "e-stat-importer-dl" -> null
      - path                       = "projects//subscriptions/e-stat-importer-dl" -> null
      - project                    = "ml-project-210100" -> null
      - retain_acked_messages      = false -> null
      - topic                      = "projects/ml-project-210100/topics/e-stat-importer-dl" -> null

      - expiration_policy {
          - ttl = "2678400s" -> null
        }

      - timeouts {}
    }

  # google_pubsub_subscription.e_stat_kakei_chousa_importer will be created
  + resource "google_pubsub_subscription" "e_stat_kakei_chousa_importer" {
      + ack_deadline_seconds       = 10
      + enable_message_ordering    = false
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "e-stat-kakei-chousa-importer"
      + path                       = (known after apply)
      + project                    = (known after apply)
      + retain_acked_messages      = false
      + topic                      = (known after apply)

      + dead_letter_policy {
          + dead_letter_topic     = (known after apply)
          + max_delivery_attempts = 5
        }

      + expiration_policy {
          + ttl = "2678400s"
        }

      + push_config {
          + push_endpoint = (known after apply)

          + oidc_token {
              + service_account_email = "pubsub-social-dashboard@ml-project-210100.iam.gserviceaccount.com"
            }
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "10s"
        }

      + timeouts {}
    }

  # google_pubsub_subscription.e_stat_kakei_chousa_importer_dl will be created
  + resource "google_pubsub_subscription" "e_stat_kakei_chousa_importer_dl" {
      + ack_deadline_seconds       = 10
      + enable_message_ordering    = false
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "e-stat-kakei-chousa-importer-dl"
      + path                       = (known after apply)
      + project                    = (known after apply)
      + retain_acked_messages      = false
      + topic                      = (known after apply)

      + expiration_policy {
          + ttl = "2678400s"
        }

      + timeouts {}
    }

  # google_pubsub_subscription_iam_policy.e_stat_kakei_chousa_importer will be created
  + resource "google_pubsub_subscription_iam_policy" "e_stat_kakei_chousa_importer" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + policy_data  = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "serviceAccount:service-754579388750@gcp-sa-pubsub.iam.gserviceaccount.com",
                        ]
                      + role    = "roles/pubsub.subscriber"
                    },
                ]
            }
        )
      + project      = (known after apply)
      + subscription = (known after apply)
    }

  # google_pubsub_topic.e_stat_importer will be destroyed
  - resource "google_pubsub_topic" "e_stat_importer" {
      - id      = "projects/ml-project-210100/topics/e-stat-importer" -> null
      - name    = "e-stat-importer" -> null
      - project = "ml-project-210100" -> null
    }

  # google_pubsub_topic.e_stat_importer_dl will be destroyed
  - resource "google_pubsub_topic" "e_stat_importer_dl" {
      - id      = "projects/ml-project-210100/topics/e-stat-importer-dl" -> null
      - name    = "e-stat-importer-dl" -> null
      - project = "ml-project-210100" -> null
    }

  # google_pubsub_topic.e_stat_kakei_chousa_importer will be created
  + resource "google_pubsub_topic" "e_stat_kakei_chousa_importer" {
      + id      = (known after apply)
      + name    = "e-stat-kakei-chousa-importer"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # google_pubsub_topic.e_stat_kakei_chousa_importer_dl will be created
  + resource "google_pubsub_topic" "e_stat_kakei_chousa_importer_dl" {
      + id      = (known after apply)
      + name    = "e-stat-kakei-chousa-importer-dl"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # google_pubsub_topic_iam_policy.e_stat_kakei_chousa_importer will be created
  + resource "google_pubsub_topic_iam_policy" "e_stat_kakei_chousa_importer" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "serviceAccount:service-754579388750@gcp-sa-pubsub.iam.gserviceaccount.com",
                        ]
                      + role    = "roles/pubsub.publisher"
                    },
                ]
            }
        )
      + project     = (known after apply)
      + topic       = (known after apply)
    }

  # module.runner["e-stat-importer"].google_cloud_run_service.main will be destroyed
  - resource "google_cloud_run_service" "main" {
      - autogenerate_revision_name = false -> null
      - id                         = "locations/asia-northeast1/namespaces/ml-project-210100/services/e-stat-importer" -> null
      - location                   = "asia-northeast1" -> null
      - name                       = "e-stat-importer" -> null
      - project                    = "ml-project-210100" -> null
      - status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "Ready"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "ConfigurationsReady"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "e-stat-importer-jqwxl"
              - latest_ready_revision_name   = "e-stat-importer-jqwxl"
              - observed_generation          = 1
              - url                          = "https://e-stat-importer-ekpjqszuwq-an.a.run.app"
            },
        ] -> null

      - metadata {
          - annotations      = {
              - "run.googleapis.com/ingress"        = "internal-and-cloud-load-balancing"
              - "run.googleapis.com/ingress-status" = "internal-and-cloud-load-balancing"
              - "serving.knative.dev/creator"       = "github-actions@ml-project-210100.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier"  = "github-actions@ml-project-210100.iam.gserviceaccount.com"
            } -> null
          - generation       = 1 -> null
          - labels           = {
              - "cloud.googleapis.com/location" = "asia-northeast1"
            } -> null
          - namespace        = "ml-project-210100" -> null
          - resource_version = "AAXEjBq+4fw" -> null
          - self_link        = "/apis/serving.knative.dev/v1/namespaces/754579388750/services/e-stat-importer" -> null
          - uid              = "31fabcdc-a47d-4601-b983-46b8f0d7aaf1" -> null
        }

      - template {
          - metadata {
              - annotations = {
                  - "autoscaling.knative.dev/maxScale" = "10"
                  - "run.googleapis.com/sandbox"       = "gvisor"
                } -> null
              - generation  = 0 -> null
            }

          - spec {
              - container_concurrency = 1 -> null
              - timeout_seconds       = 3600 -> null

              - containers {
                  - args    = [] -> null
                  - command = [] -> null
                  - image   = "us-docker.pkg.dev/cloudrun/container/hello" -> null

                  - ports {
                      - container_port = 8080 -> null
                    }

                  - resources {
                      - limits = {
                          - "cpu"    = "1000m"
                          - "memory" = "512Mi"
                        } -> null
                    }
                }
            }
        }

      - timeouts {}

      - traffic {
          - latest_revision = true -> null
          - percent         = 100 -> null
        }
    }

  # module.runner["e-stat-kakei-chousa-importer"].google_cloud_run_service.main will be created
  + resource "google_cloud_run_service" "main" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "asia-northeast1"
      + name                       = "e-stat-kakei-chousa-importer"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/ingress"        = "internal-and-cloud-load-balancing"
              + "run.googleapis.com/ingress-status" = "internal-and-cloud-load-balancing"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale" = "10"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = 1
              + serving_state         = (known after apply)
              + timeout_seconds       = 3600

              + containers {
                  + args    = []
                  + command = []
                  + image   = "us-docker.pkg.dev/cloudrun/container/hello"

                  + ports {
                      + container_port = 8080
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1000m"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }

      + timeouts {}

      + traffic {
          + latest_revision = true
          + percent         = 100
        }
    }

Plan: 7 to add, 0 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>